       identification division.
       program-id. calledprogram.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.

           display 'I am being called from outside!'
           
       end program calledprogram.